{
  "id": "curriculum-pt",
  "lang": "Ler em português 🇧🇷",
  "month": "Atualizado em fevereiro de 2024",
  "name": "João da Silva Cabral",
  "title": "Desenvolvedor Mobile/Web",
  "phone": "+55 92 99268-9937",
  "email": "joaocabral1232@gmail.com",
  "about": [
    "Inovador, criativo e comunicativo. Estou na área de desenvolvimento desde 2017, porém atuo profissionalmente desde 2019. Trabalhei em empresas do setor de testes automatizados, agronegócios, IoT e pesquisa. Ao decorrer da minha carreira arquitetei, desenvolvi design, publiquei, dei manutenção e liderei time voltado para desenvolvimento Frontend/Mobile."
  ],
  "educationName": "Formação",
  "education": [
    {
      "date": "2017-2020",
      "title": "Sistemas de Informação",
      "institution": "FUCAPI -  Fundação Centro de Análise, Pesquisa e Inovação Tecnológica"
    }
  ],
  "experienceName": "Experiência Profissional",
  "experiences": [
    {
      "title": "Engenheiro de Software - Kasco P&D",
      "start": "Jan/2022",
      "end": "Fev/2024",
      "type": "",
      "about": [
        "<b>Principais atividades:</b> Desenvolvimento de novos features com base nos requisitos do cliente, liderança do time de desenvolvimento, lidar diretamente com o cliente para novas especificações.",
        "O projeto voltado para o Agro tem como propósito modernizar uma ferramenta já utilizada por grandes fazendas e incluir novas funcionalidades. A nova interface é construída em <b>React</b>, <b>TypeScript</b> e <b>Material UI</b>. Já no backend é utilizado <b>Fastify</b>, <b>NodeJS</b>, <b>Typescript</b>, <b>Open API</b>, <b>Postgres</b> e <b>Kita</b>. Na parte Mobile é usando <b>React Native</b>."
      ]
    },
    {
      "title": "Desenvolvedor Web/Mobile - Grupo ICTS",
      "start": "Jun/2021",
      "end": "Dez/2023",
      "type": "",
      "about": [
        "<b>Principais atividades:</b> Planejamento, desenvolvimento dos projetos, integração de funcionalidades, realizações de testes e suporte para clientes. Para os principais projetos desenvolvidos na empresa eu liderei o desenvolvimento do aplicativo desde a concepção até a implementação, e lidei diretamente com o designer e cliente para o desenvolvimento das interfaces com uma ótima experiência para o usuário.",
        "<b>Rotas:</b> O projeto foi desenvolvido em <b>Flutter</b> e teve como objetivo mostrar para os colaboradores as rotas em tempo real, para os motoristas a localização de embarque dos colaboradores e o administrativo também poderia visualizar o andamento das rotas em tempo real. As tecnologias utilizadas foram: <b>GetX</b>, <b>MapBox</b>, <b>SocketIO</b> e outras tecnologias.",
        "<b>Sensoriamento:</b> O projeto teve como propósito desenvolver um APP que configure placas (IoT) de sensoriamento para que sejam realizadas coletas de dados dos sensores através do protocolo <b>MQTT</b>. O aplicativo foi desenvolvido em Flutter utilizando <b>MobX</b>, <b>Provider</b> e outras tecnologias, a interface web foi desenvolvida em <b>Angular</b>, e tinha como principal objetivo o monitoramento de todas as placas e geração de relatórios."
      ]
    },
    {
      "title": "Desenvolvedor Testes - SIDIA",
      "start": "Fev/2019",
      "end": "Jun/2021",
      "type": "",
      "about": [
        "<b>Principais atividades:</b> Executar, planejar, desenvolver testes automatizados para os principais devices da Samsung. Além de executar as principais funções de tester, fiz parte do time de automação onde foi desenvolvido ferramentas internas para melhorar a eficiência dos colaboradores. Foi utilizado tecnologias como <b>React</b>, <b>Eletron</b> e <b>Python</b>."
      ]
    }
  ],
  "ossTitle": "Projetos Pessoais",
  "oss": [
    "<b>LibrasCode</b> - App para aumentar acessibilidade e autonomia dos deficientes auditivos nos museus de Manaus. Ele tem como objetivo fazer a leitura de QR Code que contém a URL de links de vídeos do youtube, os vídeos são iniciados no próprio app.",
    "<b>Adenilso</b> - O projeto tem como propósito ser uma versão mobile do site Google Trends, para funcionamento do app é necessário apenas consumir um endpoint onde é retornado todos os países com seus 20 termos mais pesquisados no Google. Mais sobre o projeto aqui."
  ]
}
